# import numpy as np

# # Створюємо матрицю 3×4
# A = np.array([[1, 2, 3, 4],
#               [5, 6, 7, 8],
#               [9, 10, 11, 12]])


# print("Матриця A:")
# print(A)
# print(f"\nРозмірність: {A.shape[0]} рядків × {A.shape[1]} стовпців")

# # У Python індекси на 1 менше
# print(f"a(1,1) = {A[0, 0]}")   # 1
# print(f"a(2,3) = {A[1, 2]}")   # 7
# print(f"a(3,2) = {A[2, 1]}")   # 10


# # Перший рядок (всі стовпці)
# print(f"Перший рядок: {A[0, :]}")

# # Другий стовпець (всі рядки)
# print(f"Другий стовпець: {A[:, 1]}")

# # Перший рядок як матриця 1×4
# row_matrix = A[[0], :]
# print(f"Перший рядок (як матриця): {row_matrix}")
# print(f"Форма: {row_matrix.shape}")

# # Другий стовпець як матриця 3×1
# col_matrix = A[:, [1]]
# print(f"\nДругий стовпець (як матриця):\n{col_matrix}")
# print(f"Форма: {col_matrix.shape}")

# import numpy as np

# # Dataset: 5 людей, 3 ознаки (зріст, вага, вік)*

# data = np.array([
#     [170, 70, 25],  # людина 0*
#     [165, 60, 30],  # людина 1*
#     [180, 80, 22],  # людина 2*
#     [175, 75, 28],  # людина 3*
#     [160, 55, 35]   # людина 4*
# ])

# print("Dataset:")
# print(data)
# print(f"\nРозмірність: {data.shape[0]} зразків (людей) × {data.shape[1]} ознак")

# # Дані про першу людину перший рядок*
# print(f"Перша людина: {data[0, :]}")
# print(f"  Зріст: {data[0, 0]} см")
# print(f"  Вага: {data[0, 1]} кг")
# print(f"  Вік: {data[0, 2]} років")

# # Зріст всіх людей перший стовпець*
# heights = data[:, 0]
# print(f"\nЗріст всіх людей: {heights}")
# print(f"Середній зріст людини: {heights.mean():.1f} см")

# # Вага кожної людини другий стовпець*
# weights = data[:, 1]
# print(f"\nВаги кожної людини: {weights}")
# print(f"Середня вага людини: {weights.mean():.1f} кг")

# import numpy as np

# # Створюємо матрицю 3×2
# A = np.array([[1, 2],
#               [3, 4],
#               [5, 6]])

# print("Оригінальна матриця A (3×2):")
# print(A)

# # Транспонуємо
# A_T = A.T

# print("\nТранспонована A^T (2×3):")
# print(A_T)

# print(f"\nРозмірність A: {A.shape}")
# print(f"Розмірність A^T: {A_T.shape}")
import numpy as np

# Матриці з прикладу
A = np.array([[1, 2, 3],
              [4, 5, 6]]) # 2×3

B = np.array([[7, 8],
            [9, 10],
            [11, 12]])  # 3×2

# Множення A @ B
C = A @ B

print("Матриця A (2×3):")
print(A)
print("\nМатриця B (3×2):")
print(B)
print(f"\nРезультат C = A @ B ({C.shape[0]}×{C.shape[1]}):")
print(C)
